tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeChartFrame(uint32_t left, uint32_t top, uint32_t width, uint32_t height) {
    Esp32BaseWeb::sendChunk("<line x1='");
    writeUInt(left);
    Esp32BaseWeb::sendChunk("' y1='");
    writeUInt(top + height);
    Esp32BaseWeb::sendChunk("' x2='");
    writeUInt(left + width);
    Esp32BaseWeb::sendChunk("' y2='");
    writeUInt(top + height);
    Esp32BaseWeb::sendChunk("' class='chart-axis'></line><line x1='");
    writeUInt(left);
    Esp32BaseWeb::sendChunk("' y1='");
    writeUInt(top);
    Esp32BaseWeb::sendChunk("' x2='");
    writeUInt(left);
    Esp32BaseWeb::sendChunk("' y2='");
    writeUInt(top + height);
    Esp32BaseWeb::sendChunk("' class='chart-axis'></line>");
}

void writeCumulativePulseChart(uint8_t sampleIndex, const FlowCalibration::Sample& sample) {
    static constexpr uint32_t left = 62;
    static constexpr uint32_t top = 22;
    static constexpr uint32_t width = 832;
    static constexpr uint32_t height = 128;
    static constexpr uint32_t svgHeight = 200;
    const uint32_t durationMs = sample.durationMs == 0 ? 1UL : sample.durationMs;
    const uint32_t maxPulse = sample.detailCapturedPulses == 0 ? 1UL : sample.detailCapturedPulses;
    Esp32BaseWeb::sendChunk("<div class='calibration-chart'><div class='calibration-chart-head'><h3>累计脉冲</h3><span>原始明细脉冲随时间累计</span></div><svg viewBox='0 0 940 200' role='img' aria-label='累计脉冲图表'>");
    writeStableMarker(sample.stableStartMs, durationMs, left, top, width, height);
    writeChartTicks(durationMs, maxPulse, left, top, width, height);
    writeChartFrame(left, top, width, height);
    Esp32BaseWeb::sendChunk("<polyline class='chart-line cumulative' fill='none' points='");
    uint32_t timeMs = 0;
    for (uint16_t i = 0; i < sample.detailCapturedPulses; ++i) {
        timeMs += FlowCalibration::samplePulseDelta(sampleIndex, i);
        if (timeMs > durationMs) {
            timeMs = durationMs;
        }
        const uint32_t x = left + static_cast<uint32_t>((static_cast<uint64_t>(timeMs) * width) / durationMs);
        const uint32_t y = top + height - static_cast<uint32_t>((static_cast<uint64_t>(i + 1UL) * height) / maxPulse);
        writeSvgPoint(x, y);
    }
    Esp32BaseWeb::sendChunk("'></polyline>");
    writeChartAxisTitle("时间 (秒)", "累计脉冲", left, top, width, height, svgHeight);
    Esp32BaseWeb::sendChunk("</svg></div>");
}

void writeWindowPulseChart(uint8_t sampleIndex, const FlowCalibration::Sample& sample) {
    static constexpr uint32_t left = 62;
    static constexpr uint32_t top = 22;
    static constexpr uint32_t width = 832;
    static constexpr uint32_t height = 128;
    static constexpr uint32_t svgHeight = 200;
    const uint32_t durationMs = sample.durationMs == 0 ? 1UL : sample.durationMs;
    uint16_t maxWindow = 1;
    for (uint16_t i = 0; i < sample.windowPulseCount; ++i) {
        const uint16_t value = FlowCalibration::sampleWindowPulse(sampleIndex, i);
        if (value > maxWindow) {
            maxWindow = value;
        }
    }
    Esp32BaseWeb::sendChunk("<div class='calibration-chart'><div class='calibration-chart-head'><h3>2 秒滑动窗口脉冲</h3><span>窗口 ");
    writeUInt(calibrationWindowMs / 1000UL);
    Esp32BaseWeb::sendChunk(" 秒 / 步进 ");
    writeUInt(calibrationWindowStepMs);
    Esp32BaseWeb::sendChunk(" ms</span></div><svg viewBox='0 0 940 200' role='img' aria-label='滑动窗口脉冲图表'>");
    writeStableMarker(sample.stableStartMs, durationMs, left, top, width, height);
    writeChartTicks(durationMs, maxWindow, left, top, width, height);
    writeChartFrame(left, top, width, height);
    Esp32BaseWeb::sendChunk("<polyline class='chart-line window' fill='none' points='");
    for (uint16_t i = 0; i < sample.windowPulseCount; ++i) {
        uint32_t timeMs = static_cast<uint32_t>(i + 1UL) * calibrationWindowStepMs;
        if (timeMs > durationMs) {
            timeMs = durationMs;
        }
        const uint16_t value = FlowCalibration::sampleWindowPulse(sampleIndex, i);
        const uint32_t x = left + static_cast<uint32_t>((static_cast<uint64_t>(timeMs) * width) / durationMs);
        const uint32_t y = top + height - static_cast<uint32_t>((static_cast<uint64_t>(value) * height) / maxWindow);
        writeSvgPoint(x, y);
    }
    Esp32BaseWeb::sendChunk("'></polyline>");
    writeChartAxisTitle("时间 (秒)", "窗口脉冲", left, top, width, height, svgHeight);
    Esp32BaseWeb::sendChunk("</svg></div>");
}

uint8_t countPlansForDate(uint32_t ymd) {
    uint8_t count = 0;
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneConfig& zone = ZoneManager::config(zoneId);
        if (!zone.enabled) {
            continue;
        }
        for (uint8_t slot = 0; slot < Irrigation::MaxPlansPerZone; ++slot) {
            const Irrigation::PlanDefinition& plan = PlanStore::getBySlot(zoneId, slot);
            if (plan.exists && plan.enabled && PlanStore::shouldRunOnDate(plan, ymd)) {
                ++count;
            }
        }
    }
    return count;
}

void writeShortDateTimeHuman(uint32_t epoch) {
    if (epoch == 0) {
        Esp32BaseWeb::sendChunk("时间未同步");
        return;
    }
    const time_t value = static_cast<time_t>(epoch);
    tm local = {};
    if (localtime_r(&value, &local) == nullptr) {
        Esp32BaseWeb::sendChunk("时间无效");
        return;
    }
    char text[24];
    snprintf(text, sizeof(text), "%02d-%02d %02d:%02d:%02d",
             local.tm_mon + 1,
             local.tm_mday,
             local.tm_hour,
             local.tm_min,
             local.tm_sec);
    Esp32BaseWeb::sendChunk(text);
}

void writeEventTimeHuman(const Esp32BaseAppEventRecord& event) {
    uint32_t epoch = event.epochSec;
#if ESP32BASE_ENABLE_NTP
    if (epoch == 0) {
        (void)Esp32BaseNtp::resolveCurrentBootEvent(event.bootId, event.uptimeSec, &epoch);
    }
#endif
    if (epoch != 0) {
        writeShortDateTimeHuman(epoch);
        return;
    }
    Esp32BaseWeb::sendChunk("上电 ");
    writeUInt(event.bootId);
    Esp32BaseWeb::sendChunk(" 次 + ");
    writeUInt(event.uptimeSec);
    Esp32BaseWeb::sendChunk(" 秒");
}

const char* zoneStateLabel(Irrigation::ZoneState state) {
    switch (state) {
        case Irrigation::ZoneState::DISABLED: return "已禁用";
        case Irrigation::ZoneState::IDLE: return "待机";
        case Irrigation::ZoneState::STARTING: return "启动中";
        case Irrigation::ZoneState::RUNNING: return "浇水中";
        case Irrigation::ZoneState::ERROR: return "异常";
        default: return "未知";
    }
}

const char* zoneErrorLabel(Irrigation::ZoneErrorCode code) {
    switch (code) {
        case Irrigation::ZoneErrorCode::FLOW_START_TIMEOUT: return "启动后未检测到水流";
        case Irrigation::ZoneErrorCode::FLOW_NO_PULSE_TIMEOUT: return "浇水中断流";
        case Irrigation::ZoneErrorCode::LEAK_DETECTED: return "待机时检测到异常水流";
        case Irrigation::ZoneErrorCode::CONFIG_INVALID: return "配置无效";
        case Irrigation::ZoneErrorCode::NONE:
        default: return "-";
    }
}

const char* zoneErrorClearConfirm(Irrigation::ZoneErrorCode code) {
    switch (code) {
        case Irrigation::ZoneErrorCode::FLOW_START_TIMEOUT: return "确认现场已处理“启动后未检测到水流”并清除异常？";
        case Irrigation::ZoneErrorCode::FLOW_NO_PULSE_TIMEOUT: return "确认现场已处理“浇水中断流”并清除异常？";
        case Irrigation::ZoneErrorCode::LEAK_DETECTED: return "确认现场已处理“待机时检测到异常水流”并清除异常？";
        case Irrigation::ZoneErrorCode::CONFIG_INVALID: return "确认已修正配置并清除异常？";
        case Irrigation::ZoneErrorCode::NONE:
        default: return "确认现场已处理并清除异常？";
    }
}

const char* zoneErrorDescription(Irrigation::ZoneErrorCode code) {
    switch (code) {
        case Irrigation::ZoneErrorCode::FLOW_START_TIMEOUT:
            return "系统已经打开这一路阀门，但在启动等待时间内没有收到流量计脉冲。常见原因是水源未打开、阀门或管路堵塞、流量计接线异常。";
        case Irrigation::ZoneErrorCode::FLOW_NO_PULSE_TIMEOUT:
            return "浇水已经开始后，系统连续一段时间没有收到新的流量脉冲。常见原因是中途断水、水压不足、管路被关闭或流量计信号异常。";
        case Irrigation::ZoneErrorCode::LEAK_DETECTED:
            return "所有水路应处于关闭状态时，系统仍检测到流量脉冲。请检查阀门是否关严、管路是否漏水、流量计输入是否受干扰。";
        case Irrigation::ZoneErrorCode::CONFIG_INVALID:
            return "这一路当前配置不满足启动或计划执行要求。请检查水路启用状态、浇水时长上限和流量检测参数。";
        case Irrigation::ZoneErrorCode::NONE:
        default:
            return "当前没有可显示的异常详情。";
    }
}

const char* zoneErrorAdvice(Irrigation::ZoneErrorCode code) {
    switch (code) {
        case Irrigation::ZoneErrorCode::FLOW_START_TIMEOUT:
        case Irrigation::ZoneErrorCode::FLOW_NO_PULSE_TIMEOUT:
            return "确认水源、阀门、管路和流量计都正常后，再点击清除异常。清除前系统会阻止这一路继续自动或手动浇水。";
        case Irrigation::ZoneErrorCode::LEAK_DETECTED:
            return "请先到现场确认没有持续出水或漏水风险，再清除异常。实验阶段可在系统配置中临时关闭漏水检测。";
        case Irrigation::ZoneErrorCode::CONFIG_INVALID:
            return "请先修正配置，再清除异常。";
        case Irrigation::ZoneErrorCode::NONE:
        default:
            return "如果异常仍然反复出现，请查看事件记录和现场接线。";
    }
}

const char* zoneErrorSourceLabel(Irrigation::StopSource source) {
    switch (source) {
        case Irrigation::StopSource::WEB_PAGE: return "网页操作";
        case Irrigation::StopSource::HTTP_API: return "外部 API";
        case Irrigation::StopSource::LOCAL_BUTTON: return "本地按键";
        case Irrigation::StopSource::SCHEDULER: return "计划调度";
        case Irrigation::StopSource::DURATION_REACHED: return "到达目标时长";
        case Irrigation::StopSource::FLOW_MONITOR: return "流量监控";
        case Irrigation::StopSource::LEAK_MONITOR: return "漏水监控";
        case Irrigation::StopSource::CONFIG_CHANGE: return "配置变更";
        case Irrigation::StopSource::FACTORY_RESET: return "恢复出厂保护";
        case Irrigation::StopSource::UNKNOWN:
        default: return "未知来源";
    }
}

const char* zoneErrorResultLabel(Irrigation::TaskResult result) {
    switch (result) {
        case Irrigation::TaskResult::COMPLETED: return "正常完成";
        case Irrigation::TaskResult::USER_STOPPED: return "手动停止";
        case Irrigation::TaskResult::FLOW_START_TIMEOUT: return "启动后未检测到水流";
        case Irrigation::TaskResult::FLOW_NO_PULSE_TIMEOUT: return "浇水中断流";
        case Irrigation::TaskResult::LEAK_PROTECTED: return "漏水保护停止";
        case Irrigation::TaskResult::FACTORY_RESET_PROTECTED: return "恢复出厂保护停止";
        case Irrigation::TaskResult::CONFIG_INVALID: return "配置无效";
        case Irrigation::TaskResult::REJECTED: return "启动被拒绝";
        case Irrigation::TaskResult::NONE:
        default: return "无运行任务";
    }
}

void writeZoneErrorTime(const ZoneErrorStore::ZoneError& error) {
    if (error.occurredEpoch != 0) {
        writeShortDateTimeHuman(error.occurredEpoch);
        return;
    }
    if (error.occurredUptimeMs != 0) {
        Esp32BaseWeb::sendChunk("上电后 ");
        writeDurationMsHumanCompact(error.occurredUptimeMs);
        return;
    }
    Esp32BaseWeb::sendChunk("时间未记录");
}

void writeZoneErrorDialog(uint8_t zoneId, const Irrigation::ZoneConfig& config, const ZoneErrorStore::ZoneError& error) {
    Esp32BaseWeb::sendChunk("<dialog id='irrFaultDialog");
    writeUInt(zoneId);
    Esp32BaseWeb::sendChunk("' class='panel eb-modal irr-fault' data-eb-light-dismiss><h2>");
    Esp32BaseWeb::writeHtmlEscaped(config.name);
    Esp32BaseWeb::sendChunk("异常</h2><table class='kv'><tbody><tr><th>原因</th><td>");
    Esp32BaseWeb::writeHtmlEscaped(zoneErrorLabel(error.errorCode));
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>发生时间</th><td>");
    writeZoneErrorTime(error);
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>触发来源</th><td>");
    Esp32BaseWeb::writeHtmlEscaped(zoneErrorSourceLabel(error.source));
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>任务结果</th><td>");
    Esp32BaseWeb::writeHtmlEscaped(zoneErrorResultLabel(error.result));
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>说明</th><td>");
    Esp32BaseWeb::writeHtmlEscaped(zoneErrorDescription(error.errorCode));
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>处理建议</th><td>");
    Esp32BaseWeb::writeHtmlEscaped(zoneErrorAdvice(error.errorCode));
    Esp32BaseWeb::sendChunk("</td></tr></tbody></table><div class='actions'><input class='btnlink secondary' type='button' value='关闭' onclick='irrFaultClose(this)'></div></dialog>");
}

const char* taskTypeLabel(Irrigation::TaskType type) {
    switch (type) {
        case Irrigation::TaskType::PLAN: return "计划浇水";
        case Irrigation::TaskType::MANUAL:
        default: return "手动浇水";
    }
}

const char* taskResultLabel(Irrigation::TaskResult result) {
    switch (result) {
        case Irrigation::TaskResult::COMPLETED: return "正常完成";
        case Irrigation::TaskResult::USER_STOPPED: return "手动停止";
        case Irrigation::TaskResult::FLOW_START_TIMEOUT: return "启动后未检测到水流";
        case Irrigation::TaskResult::FLOW_NO_PULSE_TIMEOUT: return "浇水中断流";
        case Irrigation::TaskResult::LEAK_PROTECTED: return "漏水保护停止";
        case Irrigation::TaskResult::FACTORY_RESET_PROTECTED: return "恢复出厂保护停止";
        case Irrigation::TaskResult::CONFIG_INVALID: return "配置无效";
        case Irrigation::TaskResult::REJECTED: return "启动被拒绝";
        case Irrigation::TaskResult::NONE:
        default: return "未完成";
    }
}

