tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeEventDetail(const Esp32BaseAppEventRecord& event) {
    if (strcmp(event.type, "schedule_skipped") == 0) {
        if (strcmp(event.source, "schedule") == 0 && event.code <= static_cast<uint16_t>(Irrigation::PlanObservationStatus::MISSED)) {
            Esp32BaseWeb::writeHtmlEscaped(observationStatusLabel(static_cast<Irrigation::PlanObservationStatus>(event.code)));
            if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
                Esp32BaseWeb::sendChunk("；水路 ");
                writeEventZoneName(static_cast<uint8_t>(event.value1));
            }
            if (event.valueMask & Esp32BaseAppEventLog::VALUE2) {
                writeEventDetailValue("计划时长", event.value2, "秒");
            }
        } else {
            Esp32BaseWeb::sendChunk("已设置单次跳过");
            if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
                writeEventDetailYmd("日期", event.value1);
            }
        }
        return;
    }
    if (strcmp(event.type, "schedule_unskipped") == 0) {
        Esp32BaseWeb::sendChunk("已取消单次跳过");
        if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
            writeEventDetailYmd("日期", event.value1);
        }
        return;
    }
    if (strcmp(event.type, "schedule_tracker_fault") == 0) {
        Esp32BaseWeb::sendChunk("计划执行状态保存失败");
        if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
            Esp32BaseWeb::sendChunk("；水路 ");
            writeEventZoneName(static_cast<uint8_t>(event.value1));
        }
        if (event.valueMask & Esp32BaseAppEventLog::VALUE2) {
            writeEventDetailValue("计划 ID", event.value2, nullptr);
        }
        return;
    }
    if (strcmp(event.type, "flow_fault") == 0 || strcmp(event.type, "safety_stop") == 0) {
        Esp32BaseWeb::writeHtmlEscaped(taskResultLabel(static_cast<Irrigation::TaskResult>(event.code)));
        if (strcmp(event.type, "flow_fault") == 0) {
            if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
                writeEventDetailValue("目标", event.value1, "秒");
            }
            if (event.valueMask & Esp32BaseAppEventLog::VALUE2) {
                writeEventDetailValue("实际脉冲", event.value2, "个");
            }
            if (event.valueMask & Esp32BaseAppEventLog::VALUE3) {
                Esp32BaseWeb::sendChunk(event.value3 ? "；已锁定水路" : "；仅记录，未锁定");
            }
        }
        return;
    }
    if (strcmp(event.type, "leak_detected") == 0) {
        Esp32BaseWeb::sendChunk("待机状态检测到异常流量");
        if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
            writeEventDetailValue("实际脉冲", event.value1, "个");
        }
        if (event.valueMask & Esp32BaseAppEventLog::VALUE2) {
            writeEventDetailValue("阈值", event.value2, "个");
        }
        if (event.valueMask & Esp32BaseAppEventLog::VALUE3) {
            writeEventDetailValue("窗口", event.value3, "秒");
        }
        return;
    }
    if (strcmp(event.type, "zone_locked") == 0) {
        Esp32BaseWeb::sendChunk("水路进入异常锁定，需要人工清除");
        if (event.code <= static_cast<uint16_t>(Irrigation::ZoneErrorCode::CONFIG_INVALID)) {
            Esp32BaseWeb::sendChunk("；原因 ");
            Esp32BaseWeb::writeHtmlEscaped(zoneErrorLabel(static_cast<Irrigation::ZoneErrorCode>(event.code)));
        }
        if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
            Esp32BaseWeb::sendChunk("；任务结果 ");
            Esp32BaseWeb::writeHtmlEscaped(taskResultLabel(static_cast<Irrigation::TaskResult>(event.value1)));
        }
        return;
    }
    if (strcmp(event.type, "alert_cleared") == 0) {
        Esp32BaseWeb::sendChunk(strcmp(event.reason, "all_zones") == 0 ? "全部告警已清除" : "水路告警已清除");
        return;
    }
    if (strcmp(event.type, "factory_reset") == 0) {
        if (strcmp(event.reason, "requested") == 0) {
            Esp32BaseWeb::sendChunk("已请求恢复出厂");
        } else if (strcmp(event.reason, "executed") == 0) {
            Esp32BaseWeb::sendChunk("恢复出厂已执行");
        } else {
            Esp32BaseWeb::sendChunk("恢复出厂执行失败");
        }
        if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
            Esp32BaseWeb::sendChunk(event.value1 ? "；包含记录清空" : "；保留业务记录");
        }
        return;
    }
    if (strcmp(event.type, "flow_params_applied") == 0) {
        writeEventFlowParamsChange(event, "已应用候选流量参数");
        return;
    }
    if (strcmp(event.type, "flow_params_restored") == 0) {
        writeEventFlowParamsChange(event, "已恢复上一组流量参数");
        return;
    }
    if (strcmp(event.type, "record_store_recovered") == 0) {
        Esp32BaseWeb::sendChunk("浇水记录索引已从记录文件重建");
        if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
            writeEventDetailValue("已识别记录", event.value1, "条");
        }
        if (event.valueMask & Esp32BaseAppEventLog::VALUE2) {
            writeEventDetailValue("下一条 ID", event.value2, nullptr);
        }
        return;
    }
    if (strcmp(event.type, "record_store_fault") == 0) {
        if (strcmp(event.reason, "meta_save_failed") == 0) {
            Esp32BaseWeb::sendChunk("浇水记录索引保存失败");
            if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
                writeEventDetailValue("记录 ID", event.value1, nullptr);
            }
            if (event.valueMask & Esp32BaseAppEventLog::VALUE2) {
                writeEventDetailValue("存储槽", event.value2, nullptr);
            }
        } else {
            Esp32BaseWeb::sendChunk("浇水结束后写入记录失败");
            if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
                Esp32BaseWeb::sendChunk("；水路 ");
                writeEventZoneName(static_cast<uint8_t>(event.value1));
            }
            if (event.valueMask & Esp32BaseAppEventLog::VALUE2) {
                writeEventDetailValue("计划 ID", event.value2, nullptr);
            }
            Esp32BaseWeb::sendChunk("；结果 ");
            Esp32BaseWeb::writeHtmlEscaped(taskResultLabel(static_cast<Irrigation::TaskResult>(event.code)));
        }
        return;
    }
    if (strcmp(event.type, "config_schema_reset") == 0) {
        Esp32BaseWeb::sendChunk("保存的配置格式已更新，系统已按当前版本重新整理");
        if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
            writeEventDetailValue("受影响项", event.value1, "个");
        }
        return;
    }
    if (strcmp(event.type, "web_route_fault") == 0) {
        Esp32BaseWeb::sendChunk("业务网页或 API 注册不完整");
        if (event.valueMask & Esp32BaseAppEventLog::VALUE1) {
            writeEventDetailValue("失败数量", event.value1, "个");
        }
        return;
    }
    Esp32BaseWeb::writeHtmlEscaped(event.text);
}

const char* appEventUserExplanation(const Esp32BaseAppEventRecord& event) {
    if (strcmp(event.type, "schedule_skipped") == 0) {
        return strcmp(event.source, "schedule") == 0
            ? "到计划时间时，系统判断本次计划不应该或不能启动，所以没有打开阀门。"
            : "用户或外部系统为某个计划设置了单次跳过。到这一天时，该计划不会自动浇水。";
    }
    if (strcmp(event.type, "schedule_unskipped") == 0) {
        return "之前设置的单次跳过已取消，符合条件时计划会按原规则继续执行。";
    }
    if (strcmp(event.type, "schedule_tracker_fault") == 0) {
        return "系统未能保存计划执行跟踪状态，可能影响下次判断该计划是否已经处理过。";
    }
    if (strcmp(event.type, "flow_fault") == 0) {
        return "浇水过程中流量监控发现异常，系统已经停止本次浇水；如果配置要求锁定水路，需要人工确认后再清除异常。";
    }
    if (strcmp(event.type, "safety_stop") == 0) {
        return "系统按保护规则停止了正在执行的浇水任务，用于避免异常情况下继续出水。";
    }
    if (strcmp(event.type, "leak_detected") == 0) {
        return "没有浇水任务时仍检测到流量脉冲，系统将其视为可能漏水、阀门未关严或输入信号异常。";
    }
    if (strcmp(event.type, "zone_locked") == 0) {
        return "这一路已进入异常锁定状态。锁定期间系统会阻止它继续自动或手动浇水。";
    }
    if (strcmp(event.type, "alert_cleared") == 0) {
        return "用户已清除水路告警。清除只代表确认处理完成，不会修改历史记录。";
    }
    if (strcmp(event.type, "factory_reset") == 0) {
        return "设备执行了恢复出厂相关操作。请结合说明确认是否包含业务记录清空。";
    }
    if (strcmp(event.type, "flow_params_applied") == 0) {
        return "用户把候选流量参数设为当前参数，后续估算水量和流量判断会使用新参数。";
    }
    if (strcmp(event.type, "flow_params_restored") == 0) {
        return "用户把当前流量参数恢复为上一组参数，后续估算水量和流量判断会使用恢复后的参数。";
    }
    if (strcmp(event.type, "record_store_recovered") == 0) {
        return "系统启动时发现浇水记录索引需要修复，并已从记录文件重建索引。已有记录通常仍可继续查看。";
    }
    if (strcmp(event.type, "record_store_fault") == 0) {
        return "浇水记录写入或索引保存失败。该次浇水的历史记录可能不完整，但阀门控制不依赖这条记录继续运行。";
    }
    if (strcmp(event.type, "config_schema_reset") == 0) {
        return "设备中保存的配置格式与当前固件不一致，系统已按当前固件的配置结构重新整理。";
    }
    if (strcmp(event.type, "web_route_fault") == 0) {
        return "业务网页或 API 没有全部注册成功，部分页面或接口可能无法访问。";
    }
    return "系统记录了一条灌溉业务事件，当前固件没有更具体的用户说明。";
}

const char* appEventUserAdvice(const Esp32BaseAppEventRecord& event) {
    if (strcmp(event.type, "flow_fault") == 0 ||
        strcmp(event.type, "leak_detected") == 0 ||
        strcmp(event.type, "zone_locked") == 0) {
        return "请先检查水源、阀门、管路和流量计接线。确认现场安全后，再在水路页面清除异常。";
    }
    if (strcmp(event.type, "record_store_fault") == 0 ||
        strcmp(event.type, "record_store_recovered") == 0 ||
        strcmp(event.type, "config_schema_reset") == 0) {
        return "如果这类事件反复出现，请检查文件系统状态、电源稳定性，并保留事件记录用于排查。";
    }
    if (strcmp(event.type, "web_route_fault") == 0 ||
        strcmp(event.type, "schedule_tracker_fault") == 0) {
        return "如果重启后仍反复出现，请重新编译烧录当前固件，并检查事件记录中的时间和触发页面。";
    }
    if (strcmp(event.type, "flow_params_applied") == 0 ||
        strcmp(event.type, "flow_params_restored") == 0) {
        return "建议观察后续浇水记录中的估算水量和流速。如果明显不准，请重新采集校准样本。";
    }
    return "通常无需额外处理。需要追溯原因时，可结合浇水记录和现场操作时间查看。";
}

void writeManualStartDialog() {
    const Irrigation::SystemConfig& system = SystemConfigStore::current();
    const uint32_t maxMin = system.maxWateringDurationSec / 60UL;
    const uint32_t defaultMin = durationMinutesForUi(system.manualDefaultDurationSec);

    Esp32BaseWeb::sendChunk("<style>"
                            ".irrmanual{max-width:520px}.irrmanual h2{margin-bottom:10px}.irrmanual-summary{display:grid;grid-template-columns:88px minmax(0,1fr);gap:6px 12px;border:1px solid var(--eb-line-soft);background:var(--eb-soft);border-radius:8px;padding:9px 10px;margin:0 0 12px}.irrmanual-summary b{color:var(--eb-muted);font-weight:650}.irrmanual-summary span{min-width:0}.irrmanual .durationrow{display:grid;grid-template-columns:minmax(0,1fr) auto;gap:10px;align-items:end;margin-bottom:10px}.irrmanual .durationrow input{width:9ch;max-width:9ch;margin:0}.irrmanual-presets{display:grid;grid-template-columns:repeat(3,minmax(0,1fr));gap:6px;margin-top:6px}.irrmanual-presets .btnlink{width:100%;min-height:32px}.irrmanual-note{font-size:12px;color:var(--eb-muted);line-height:1.45;margin:8px 0 0}@media(max-width:560px){.irrmanual .durationrow{grid-template-columns:1fr}.irrmanual-presets{grid-template-columns:repeat(2,minmax(0,1fr))}}"
                            "</style><dialog id='irrManualDialog' class='panel eb-modal irrmanual'><form id='irrManualForm' class='editform' method='post' action='/api/v1/zone/start' data-default-min='");
    writeUInt(defaultMin);
    Esp32BaseWeb::sendChunk("' onsubmit=\"return irrManualSubmit(this)&&confirm('确认启动手动浇水？')&&irrManualSend(this,once(this))\"><h2>启动手动浇水</h2>");
    writeOnePostHidden("source", "web_page");
    Esp32BaseWeb::sendChunk("<input type='hidden' name='zoneId' value=''><div class='irrmanual-summary'><b>水路</b><span id='irrManualZoneName'></span><b>安全确认</b><span>远程启动前请确认现场安全，阀门和管路可以正常出水。</span></div><div class='durationrow'><p class='field'><label>浇水分钟数</label><input id='irrManualDuration' name='durationMin' type='number' min='1' max='");
    writeUInt(maxMin);
    Esp32BaseWeb::sendChunk("' value='");
    writeUInt(defaultMin);
    Esp32BaseWeb::sendChunk("'><small>默认 ");
    writeUInt(defaultMin);
    Esp32BaseWeb::sendChunk(" 分钟，最大 ");
    writeUInt(maxMin);
    Esp32BaseWeb::sendChunk(" 分钟。</small></p><div><label>快捷时长</label><div class='irrmanual-presets'>");
    for (uint8_t i = 0; i < 6; ++i) {
        const uint32_t presetMin = durationMinutesForUi(system.durationPresets[i]);
        Esp32BaseWeb::sendChunk("<button class='btnlink compact' type='button' data-min='");
        writeUInt(presetMin);
        Esp32BaseWeb::sendChunk("' onclick='irrManualPreset(this)'>");
        writeUInt(presetMin);
        Esp32BaseWeb::sendChunk(" 分钟</button>");
    }
    Esp32BaseWeb::sendChunk("</div><p class='irrmanual-note'>点选快捷时长会自动填入，确认启动前仍可手动修改。</p></div></div><div class='actions'><input type='submit' value='确认启动'><input class='btnlink secondary' type='button' value='取消' onclick='irrManualCancel()'></div></form></dialog>"
                            "<script>"
                            "function irrManualOpen(b){var d=document.getElementById('irrManualDialog'),f=document.getElementById('irrManualForm');f.elements['zoneId'].value=b.dataset.zoneId;f.elements['durationMin'].value=f.dataset.defaultMin;document.getElementById('irrManualZoneName').textContent=b.dataset.zoneName;if(d.showModal)d.showModal();else d.setAttribute('open','open');}"
                            "function irrManualPreset(b){document.getElementById('irrManualDuration').value=b.dataset.min;}"
                            "function irrManualCancel(){var d=document.getElementById('irrManualDialog');if(d.close)d.close();else d.removeAttribute('open');}"
                            "function irrManualSubmit(f){var m=parseInt(f.elements['durationMin'].value||'0',10),max=parseInt(f.elements['durationMin'].max||'0',10);if(!m||m<1||m>max){alert('请输入 1 到 '+max+' 分钟');return false;}return true;}"
                            "function irrManualReset(f){delete f.dataset.busy;var b=f.querySelector('[type=submit]');if(b)b.disabled=false;}"
                            "function irrManualSend(f,ready){if(!ready)return false;if(!window.fetch||!window.URLSearchParams||!window.FormData)return true;fetch(f.action,{method:'POST',headers:{'X-Esp32Base-Ajax':'1',Accept:'application/json','Content-Type':'application/x-www-form-urlencoded'},body:new URLSearchParams(new FormData(f)).toString(),credentials:'same-origin'}).then(function(r){return r.json().catch(function(){return {ok:false,error:'bad_response'};});}).then(function(j){if(!j||!j.ok){alert('启动失败：'+((j&&j.error)||'请求失败'));irrManualReset(f);return;}irrManualCancel();irrManualReset(f);if(window.irrOverviewPollNow)irrOverviewPollNow();}).catch(function(){alert('启动失败：网络请求失败');irrManualReset(f);});return false;}"
                            "</script>");
}

void readPaging(uint16_t total, uint16_t defaultPerPage, uint32_t* page, uint32_t* perPage, uint16_t* offset) {
    uint32_t rawPage = 1;
    uint32_t rawPer = defaultPerPage;
    (void)readU32("page", &rawPage);
    (void)readU32("per", &rawPer);
    if (rawPer != 10 && rawPer != 20 && rawPer != 50) {
        rawPer = defaultPerPage;
    }
    const uint32_t totalPages = total == 0 ? 1 : ((static_cast<uint32_t>(total) + rawPer - 1UL) / rawPer);
    if (rawPage < 1) {
        rawPage = 1;
    } else if (rawPage > totalPages) {
        rawPage = totalPages;
    }
    *page = rawPage;
    *perPage = rawPer;
    *offset = static_cast<uint16_t>((rawPage - 1UL) * rawPer);
}

void handleOverviewPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    pageHeader("灌溉总览");
    Esp32BaseWeb::sendPageTitle("灌溉总览", "查看今天是否还有计划、当前哪些水路在浇水；需要临时补水时，可在水路状态中启动。");
    if (Esp32BaseWeb::hasParam("alert_cleared")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "异常已清除", "系统已记录本次清除操作。");
    }
    if (ZoneConfigStore::schemaResetDetected()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "水路配置已重置", "检测到已保存的水路配置格式不匹配，已使用当前固件默认配置。请检查水路启用、名称和流量参数。");
    }
    if (PlanStore::schemaResetDetected()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "计划配置已重置", "检测到已保存的计划配置格式不匹配，相关计划已使用当前固件默认状态。请重新检查计划。");
    }

    uint8_t enabledCount = 0;
    uint8_t runningCount = 0;
    uint8_t errorCount = 0;
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneStatus status = ZoneManager::status(zoneId);
        if (!status.enabled) {
            continue;
        }
        ++enabledCount;
        if (status.busy) {
            ++runningCount;
        }
        if (status.errorActive) {
            ++errorCount;
        }
    }
    const uint8_t todayPlanCount = countPlansForDate(currentYmd());

