tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writePlanRow(const Irrigation::PlanDefinition& plan) {
    Esp32BaseWeb::sendChunk("<tr><td>");
    Esp32BaseWeb::writeHtmlEscaped(plan.name);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::sendChunk(plan.enabled ? "启用" : "停用");
    Esp32BaseWeb::sendChunk("</td><td>");
    writeTime(plan.timeHour, plan.timeMinute);
    Esp32BaseWeb::sendChunk("</td><td>");
    writeDurationMinutes(plan.durationSec);
    Esp32BaseWeb::sendChunk("</td><td>");
    writeCycleSummary(plan);
    Esp32BaseWeb::sendChunk("</td><td><div class='fsactions'><a class='btnlink compact' href='/irrigation/plan?planId=");
    writeUInt(plan.planId);
    Esp32BaseWeb::sendChunk("'>编辑</a><form method='post' action='");
    Esp32BaseWeb::sendChunk(plan.enabled ? "/api/v1/plan/disable" : "/api/v1/plan/enable");
    Esp32BaseWeb::sendChunk("' onsubmit=\"return confirm('确认切换计划状态？')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    writeHiddenU32("planId", plan.planId);
    Esp32BaseWeb::sendChunk("<input class='fsaction' type='submit' value='");
    Esp32BaseWeb::sendChunk(plan.enabled ? "停用" : "启用");
    Esp32BaseWeb::sendChunk("'></form><form method='post' action='/api/v1/plan/delete' onsubmit=\"return confirm('确认删除该计划？')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    writeHiddenU32("planId", plan.planId);
    Esp32BaseWeb::sendChunk("<input class='fsdelete danger' type='submit' value='删除'></form></div></td></tr>");
}

void handlePlansPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    pageHeader("计划");
    Esp32BaseWeb::sendPageTitle("计划", "每个 Zone 最多 6 条计划。");
    bool wroteZone = false;
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneConfig& zone = ZoneManager::config(zoneId);
        if (!zone.enabled) {
            continue;
        }
        wroteZone = true;
        Esp32BaseWeb::beginPanel(zone.name);
        Esp32BaseWeb::sendChunk("<div class='actions'>");
        if (PlanStore::countForZone(zoneId) < Irrigation::MaxPlansPerZone) {
            Esp32BaseWeb::sendChunk("<a class='btnlink compact' href='/irrigation/plan?zoneId=");
            writeUInt(zoneId);
            Esp32BaseWeb::sendChunk("'>新增计划</a>");
        } else {
            Esp32BaseWeb::sendChunk("<span class='tag'>计划已满</span>");
        }
        Esp32BaseWeb::sendChunk("</div><div class='tablewrap'><table class='part'><thead><tr><th>名称</th><th>状态</th><th>时间</th><th>时长</th><th>循环</th><th>操作</th></tr></thead><tbody>");
        bool wrote = false;
        for (uint8_t slot = 0; slot < Irrigation::MaxPlansPerZone; ++slot) {
            const Irrigation::PlanDefinition& plan = PlanStore::getBySlot(zoneId, slot);
            if (plan.exists) {
                writePlanRow(plan);
                wrote = true;
            }
        }
        if (!wrote) {
            Esp32BaseWeb::sendChunk("<tr><td colspan='6'>暂无计划</td></tr>");
        }
        Esp32BaseWeb::sendChunk("</tbody></table></div>");
        Esp32BaseWeb::endPanel();
    }
    if (!wroteZone) {
        Esp32BaseWeb::beginPanel("计划");
        Esp32BaseWeb::sendChunk("<p class='muted'>暂无启用水路。请先到水路管理中启用需要使用的水路。</p>");
        Esp32BaseWeb::endPanel();
    }
    pageFooter();
}

Irrigation::PlanDefinition makeDraftPlan(uint8_t zoneId) {
    Irrigation::PlanDefinition plan = {};
    plan.exists = true;
    plan.zoneId = zoneId;
    strlcpy(plan.name, "新计划", sizeof(plan.name));
    plan.enabled = false;
    plan.timeHour = 7;
    plan.timeMinute = 0;
    plan.durationSec = SystemConfigStore::current().manualDefaultDurationSec;
    plan.cycleDays = 1;
    plan.cycleMask = 1;
    plan.cycleStartYmd = currentYmd();
    return plan;
}

bool applyPlanForm(Irrigation::PlanDefinition& plan, const char** error) {
    uint32_t value = 0;
    if (Esp32BaseWeb::hasParam("name") && !Esp32BaseWeb::getParam("name", plan.name, sizeof(plan.name))) {
        *error = "invalid_name";
        return false;
    }
    if (Esp32BaseWeb::hasParam("enabledPresent")) {
        plan.enabled = readCheckbox("enabled");
    } else if (Esp32BaseWeb::hasParam("enabled") && !readBool("enabled", &plan.enabled)) {
        *error = "invalid_enabled";
        return false;
    }
    if (Esp32BaseWeb::hasParam("time") && !readTimeParam("time", &plan.timeHour, &plan.timeMinute)) {
        *error = "invalid_time";
        return false;
    }
    if (Esp32BaseWeb::hasParam("durationMin")) {
        if (!readU32("durationMin", &value) || value == 0 || value > (SystemConfigStore::current().maxWateringDurationSec / 60UL)) {
            *error = "invalid_duration";
            return false;
        }
        plan.durationSec = value * 60UL;
    } else if (Esp32BaseWeb::hasParam("durationSec") && !readU32("durationSec", &plan.durationSec)) {
        *error = "invalid_duration";
        return false;
    }
    if (Esp32BaseWeb::hasParam("cycleDays") && !readU8("cycleDays", &plan.cycleDays)) {
        *error = "invalid_cycle_days";
        return false;
    }
    if (plan.cycleDays < 1 || plan.cycleDays > 30) {
        *error = "invalid_cycle_days";
        return false;
    }
    if (Esp32BaseWeb::hasParam("cycleMask") && !readU32("cycleMask", &plan.cycleMask)) {
        *error = "invalid_cycle_mask";
        return false;
    }
    const uint32_t validMask = (1UL << plan.cycleDays) - 1UL;
    plan.cycleMask &= validMask;
    if (plan.cycleMask == 0) {
        *error = "invalid_cycle_mask";
        return false;
    }
    if (Esp32BaseWeb::hasParam("cycleStartYmd") && !readYmd("cycleStartYmd", &plan.cycleStartYmd)) {
        *error = "invalid_cycle_start";
        return false;
    }
    if (!PlanStore::validYmd(plan.cycleStartYmd)) {
        *error = "invalid_cycle_start";
        return false;
    }
    if (plan.durationSec > SystemConfigStore::current().maxWateringDurationSec) {
        *error = "duration_exceeds_system_limit";
        return false;
    }
    return true;
}

void writePlanForm(const Irrigation::PlanDefinition& plan, bool creating) {
    Esp32BaseWeb::sendChunk("<style>"
                            ".planform{max-width:940px}.planform-section{grid-column:1/-1;margin:2px 0 0;padding-top:4px;border-top:1px solid var(--eb-line-soft)}.planform-section:first-of-type{border-top:0;padding-top:0}.planform-section b{display:block;margin-bottom:2px}.planform-section small{display:block;color:var(--eb-muted);font-size:12px;line-height:1.45}.planform-cycle{grid-column:1/-1;display:grid;grid-template-columns:minmax(132px,168px) minmax(180px,220px) minmax(0,1fr);gap:12px 16px;align-items:start;border:1px solid var(--eb-line-soft);background:var(--eb-soft);border-radius:8px;padding:10px 12px}.planform-cycle .field{min-width:0}.planform-cycle .field input{width:100%;box-sizing:border-box}.cycleday-block{min-width:0}.cycleday-grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(78px,1fr));gap:7px;margin-top:4px}.cycleday-grid label{display:flex;align-items:center;gap:6px;min-height:32px;margin:0;padding:4px 8px;border:1px solid var(--eb-line);border-radius:7px;background:var(--eb-surface);font-weight:650;white-space:nowrap}.cycleday-grid input{margin:0}.planform .hintline{margin-top:6px;color:var(--eb-muted);font-size:12px;line-height:1.45}@media(max-width:760px){.planform-cycle{grid-template-columns:1fr}.cycleday-grid{grid-template-columns:repeat(auto-fit,minmax(88px,1fr))}}"
                            "</style>");
    Esp32BaseWeb::sendChunk("<form class='editform planform' method='post' action='");
    Esp32BaseWeb::sendChunk(creating ? "/api/v1/plan/create" : "/api/v1/plan/update");
    Esp32BaseWeb::sendChunk("' onsubmit=\"return irrPlanPrepare(this)&&confirm('确认保存计划？')&&once(this)\">");
    writeOnePostHidden("source", "web_page");
    if (creating) {
        writeHiddenU32("zoneId", plan.zoneId);
    } else {
        writeHiddenU32("planId", plan.planId);
    }
    Esp32BaseWeb::sendChunk("<input type='hidden' name='cycleMask' value='");
    writeUInt(plan.cycleMask);
    Esp32BaseWeb::sendChunk("'><input type='hidden' name='durationSec' value='");
    writeUInt(plan.durationSec);
    Esp32BaseWeb::sendChunk("'><input type='hidden' name='enabledPresent' value='1'><div class='fieldgrid'>"
                            "<p class='planform-section'><b>基本信息</b><small>用于识别这条计划，并控制它是否参与自动执行。</small></p>"
                            "<p class='field long'><label>名称</label><input name='name' maxlength='31' value='");
    Esp32BaseWeb::writeHtmlEscaped(plan.name);
    Esp32BaseWeb::sendChunk("'><small>会显示在计划列表和浇水记录里。</small></p><p class='field med'><label><input type='checkbox' name='enabled' value='1'");
    Esp32BaseWeb::sendChunk(plan.enabled ? " checked" : "");
    Esp32BaseWeb::sendChunk("> 启用计划</label><small>勾选后，到点才会自动检查是否执行。</small></p>"
                            "<p class='planform-section'><b>执行设置</b><small>设置每天检查计划的时间，以及单次浇水时长。</small></p>"
                            "<p class='field med'><label>开始时间</label><input name='time' type='time' value='");
    writeTime(plan.timeHour, plan.timeMinute);
    Esp32BaseWeb::sendChunk("'><small>到达该时间后检查当天是否是执行日。</small></p><p class='field med'><label>浇水时长（分钟）</label><input name='durationMin' type='number' min='1' max='");
    writeUInt(SystemConfigStore::current().maxWateringDurationSec / 60UL);
    Esp32BaseWeb::sendChunk("' value='");
    writeUInt(durationMinutesForUi(plan.durationSec));
    Esp32BaseWeb::sendChunk("'><small>受系统单次最长时间约束。</small></p>"
                            "<p class='planform-section'><b>循环设置</b><small>循环天数决定下面出现多少个执行日；例如 5 天循环只显示第 1 到第 5 天。</small></p>"
                            "<div class='planform-cycle'><p class='field'><label>循环天数</label><input name='cycleDays' type='number' min='1' max='30' value='");
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk("' oninput='irrPlanRenderDays(this.form)' onchange='irrPlanRenderDays(this.form)'><small>范围 1 到 30 天。</small></p><p class='field'><label>起始日期</label><input name='cycleStartYmd' type='date' value='");
    writeYmdInput(plan.cycleStartYmd);
    Esp32BaseWeb::sendChunk("'><small>用于计算今天处于循环中的第几天。</small></p><div class='cycleday-block'><label>执行日</label><div class='cycleday-grid' aria-label='执行日'></div><p class='hintline'>只勾选需要浇水的循环日，未勾选的日子会自动跳过。</p></div></div></div><div class='actions'><input type='submit' value='保存'><a class='btnlink secondary' href='/irrigation/plans'>返回</a></div></form>"
                            "<script>"
                            "function irrPlanClampDays(f){var n=parseInt(f.cycleDays.value||'1',10);if(!n)n=1;n=Math.min(30,Math.max(1,n));f.cycleDays.value=String(n);return n;}"
                            "function irrPlanMaskLimit(n){return (1<<n)-1;}"
                            "function irrPlanCurrentMask(f){var mask=0,boxes=f.querySelectorAll('.cycleday-grid input');for(var i=0;i<boxes.length;i++){if(boxes[i].checked)mask|=(1<<parseInt(boxes[i].value,10));}return mask;}"
                            "function irrPlanSyncMask(f){var mask=irrPlanCurrentMask(f);f.cycleMask.value=String(mask);return mask;}"
                            "function irrPlanRenderDays(f){var n=irrPlanClampDays(f),grid=f.querySelector('.cycleday-grid'),stored=parseInt(f.cycleMask.value||'0',10)||0,mask=irrPlanCurrentMask(f)||stored||1;mask&=irrPlanMaskLimit(n);if(mask===0)mask=1;var frag=document.createDocumentFragment();for(var i=0;i<n;i++){var label=document.createElement('label'),input=document.createElement('input');input.type='checkbox';input.value=String(i);input.checked=!!(mask&(1<<i));input.onchange=function(){irrPlanSyncMask(f);};label.appendChild(input);label.appendChild(document.createTextNode('第 '+(i+1)+' 天'));frag.appendChild(label);}grid.replaceChildren(frag);f.cycleMask.value=String(mask);}"
                            "function irrPlanPrepare(f){var m=parseInt(f.durationMin.value||'0',10),n=irrPlanClampDays(f),mask=irrPlanSyncMask(f);if(!m||m<1){alert('浇水时长无效');return false;}f.durationSec.value=String(m*60);if(!n||n<1||n>30){alert('循环天数无效');return false;}if(!mask){alert('至少选择一个执行日');return false;}return true;}"
                            "irrPlanRenderDays(document.currentScript.previousElementSibling);"
                            "</script>");
}

void handlePlanEditPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint32_t planId = 0;
    uint8_t zoneId = 0;
    Irrigation::PlanDefinition plan = {};
    const bool editing = Esp32BaseWeb::hasParam("planId");
    if (editing && (!readU32("planId", &planId) || !PlanStore::getById(planId, &plan))) {
        pageHeader("计划编辑");
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "计划不存在", "请返回计划页重新选择。");
        pageFooter();
        return;
    }
    if (!editing) {
        if (!readZoneId(&zoneId)) {
            pageHeader("新增计划");
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "水路不存在", "请返回计划页重新选择。");
            pageFooter();
            return;
        }
        plan = makeDraftPlan(zoneId);
    }
    pageHeader(editing ? "计划编辑" : "新增计划");
    Esp32BaseWeb::beginPanel(editing ? plan.name : ZoneManager::config(zoneId).name);
    writePlanForm(plan, !editing);
    Esp32BaseWeb::endPanel();
    pageFooter();
}

void handleSettingsPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint8_t editZoneId = 0;
    if (Esp32BaseWeb::hasParam("zoneId")) {
        if (!readZoneId(&editZoneId)) {
            pageHeader("水路管理");
            Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "水路不存在", "请返回水路管理页重新选择。");
            pageFooter();
            return;
        }
        const Irrigation::ZoneConfig& zone = ZoneManager::config(editZoneId);
        pageHeader("水路编辑");
        Esp32BaseWeb::sendPageTitle("水路编辑", "设置水路名称、是否使用和异常处理方式。流量估算参数在流量校准页通过候选参数应用。");
        writeFlowParameterLineStyle();
        Esp32BaseWeb::beginPanel(zone.name);
        Esp32BaseWeb::sendChunk("<form class='editform' method='post' action='/api/v1/zone/config' onsubmit=\"return confirm('确认保存水路配置？')&&once(this)\">");
        writeOnePostHidden("source", "web_page");
        writeHiddenU32("zoneId", editZoneId);
        Esp32BaseWeb::sendChunk("<input type='hidden' name='enabledPresent' value='1'><input type='hidden' name='suppressErrorPresent' value='1'><div class='fieldgrid'><p class='field full'><b>基本信息</b><small>决定这一路是否出现在首页、计划和记录里。</small></p><p class='field med'><label>名称</label><input name='name' maxlength='31' value='");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("'><small>显示在首页、计划和记录中的水路名称。</small></p><p class='field med'><label><input type='checkbox' name='enabled' value='1'");
        Esp32BaseWeb::sendChunk(zone.enabled ? " checked" : "");
        Esp32BaseWeb::sendChunk("> 启用水路</label><small>未启用的水路不会出现在首页和计划业务页面，也不能启动浇水。</small></p><p class='field full'><b>硬件引脚</b><small>固定 4 路硬件定义，只用于安装核对和现场排查，不能在页面修改。</small></p><p class='field med'><label>阀门控制 GPIO</label><code>GPIO");
        writeUInt(zone.valvePin);
        Esp32BaseWeb::sendChunk("</code><small>控制这一路电磁阀或阀门驱动输出。</small></p><p class='field med'><label>流量计输入 GPIO</label><code>GPIO");
        writeUInt(zone.flowPin);
        Esp32BaseWeb::sendChunk("</code><small>连接这一路流量计脉冲信号；输入脚需要按硬件设计提供稳定上拉。</small></p><p class='field full'><b>当前流量估算参数</b><small>当前参数只读；候选参数可手工填写、从其他水路填入或由校准样本生成，再到流量校准页设为当前。</small></p><div class='field full'>");
        writeFlowParameterLine(zone.flow);
        Esp32BaseWeb::sendChunk("<div class='actions'><a class='btnlink secondary' href='/irrigation/calibration'>管理候选参数</a></div></div><p class='field full'><b>异常处理</b><small>用于判断开阀后是否真的有水流，以及水流中断时如何处理。</small></p><p class='field short'><label>启动超时秒</label><input name='startTimeoutSec' type='number' min='1' max='300' value='");
        writeUInt(zone.startTimeoutSec);
        Esp32BaseWeb::sendChunk("'><small>开阀后在该时间内没有检测到水流，判定启动异常。</small></p><p class='field short'><label>无脉冲超时秒</label><input name='flowNoPulseTimeoutSec' type='number' min='1' max='300' value='");
        writeUInt(zone.flowNoPulseTimeoutSec);
        Esp32BaseWeb::sendChunk("'><small>运行中超过该时间没有新脉冲，判定断流异常。</small></p><p class='field full'><label><input type='checkbox' name='suppressError' value='1'");
        Esp32BaseWeb::sendChunk(zone.suppressError ? " checked" : "");
        Esp32BaseWeb::sendChunk("> 流量异常只记录，不锁定水路</label><small>勾选后，系统仍会停止本次浇水并写入记录，但不会把这一路锁定为异常；取消勾选时，出现无水流或断流后需要人工清除异常。</small></p></div><div class='actions'><input type='submit' value='保存水路配置'><a class='btnlink secondary' href='/irrigation/zones'>返回列表</a></div></form>");
        Esp32BaseWeb::endPanel();
        pageFooter();
        return;
    }

    pageHeader("水路管理");
    Esp32BaseWeb::sendPageTitle("水路管理", "查看 4 路水路状态；点击编辑进入单个水路配置。系统级参数在基础库 App Config 中设置。");
    Esp32BaseWeb::beginPanel("水路列表");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>水路</th><th>启用状态</th><th>启动超时</th><th>无脉冲超时</th><th>流量估算</th><th>错误策略</th><th>操作</th></tr></thead><tbody>");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneConfig& zone = ZoneManager::config(zoneId);
        Esp32BaseWeb::sendChunk("<tr><td>");
        Esp32BaseWeb::writeHtmlEscaped(zone.name);
        Esp32BaseWeb::sendChunk("</td><td><span class='tag");
        Esp32BaseWeb::sendChunk(zone.enabled ? " ok" : "");
        Esp32BaseWeb::sendChunk("'>");
        Esp32BaseWeb::sendChunk(zone.enabled ? "启用" : "停用");
        Esp32BaseWeb::sendChunk("</span></td><td>");
        writeUInt(zone.startTimeoutSec);
        Esp32BaseWeb::sendChunk(" 秒</td><td>");
        writeUInt(zone.flowNoPulseTimeoutSec);
        Esp32BaseWeb::sendChunk(" 秒</td><td>");
        writeUInt(zone.flow.startupPulseLimit);
        Esp32BaseWeb::sendChunk(" 脉冲启动 / ");
        writeUInt(zone.flow.startupEstimatedMl);
        Esp32BaseWeb::sendChunk(" ml · 稳定 ");
        writeUInt(zone.flow.stablePulsePerLiter);
        Esp32BaseWeb::sendChunk(" P/L</td><td>");
        Esp32BaseWeb::sendChunk(zone.suppressError ? "只记录，不锁定异常" : "检测异常并锁定水路");
        Esp32BaseWeb::sendChunk("</td><td><a class='btnlink compact' href='/irrigation/zones?zoneId=");
        writeUInt(zoneId);
        Esp32BaseWeb::sendChunk("'>编辑</a></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    Esp32BaseWeb::endPanel();
    pageFooter();
}

