tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void handleCalibrationSampleDetailPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint8_t displayIndex = 0;
    if (!readU8("index", &displayIndex) || displayIndex == 0 || displayIndex > FlowCalibration::sampleCount()) {
        pageHeader("样本详情");
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "样本不存在", "请选择一个有效的校准样本。");
        Esp32BaseWeb::sendChunk("<div class='actions'><a class='btnlink secondary' href='/irrigation/calibration'>返回流量校准</a></div>");
        pageFooter();
        return;
    }
    const uint8_t sampleIndex = static_cast<uint8_t>(displayIndex - 1);
    const FlowCalibration::Sample& sample = FlowCalibration::sample(sampleIndex);
    pageHeader("样本详情");
    Esp32BaseWeb::sendPageTitle("校准样本详情", "查看本次采集的脉冲明细、累计脉冲和滑动窗口流速变化。");
    Esp32BaseWeb::sendChunk("<style>"
                            ".calibration-detail-grid{display:grid;grid-template-columns:repeat(auto-fit,minmax(160px,1fr));gap:10px;margin:8px 0 12px}"
                            ".calibration-detail-summary{display:grid;grid-template-columns:repeat(auto-fit,minmax(190px,1fr));gap:8px;margin:10px 0 0}"
                            ".calibration-detail-summary span{border:1px solid var(--eb-border);border-radius:8px;background:var(--eb-surface-subtle);padding:8px 10px}"
                            ".calibration-detail-summary b{display:block;color:var(--eb-muted);font-size:.88rem;margin-bottom:2px}"
                            ".calibration-chart{margin:14px 0;border:1px solid var(--eb-border);border-radius:8px;padding:12px 14px 10px;background:linear-gradient(180deg,#fff,#f8fbfd);box-shadow:0 1px 2px rgba(15,23,42,.04)}"
                            ".calibration-chart-head{display:flex;justify-content:space-between;gap:12px;align-items:baseline;margin-bottom:8px}"
                            ".calibration-chart h3{margin:0;font-size:1rem}"
                            ".calibration-chart-head span{color:var(--eb-muted);font-size:.9rem}"
                            ".calibration-chart svg{width:100%;height:auto;max-height:240px;display:block;background:#fff;border:1px solid #e2e8f0;border-radius:6px}"
                            ".chart-grid{stroke:#e8eef5;stroke-width:1}"
                            ".chart-axis{stroke:#94a3b8;stroke-width:1.4}"
                            ".chart-tick{fill:#64748b;font-size:12px}"
                            ".chart-axis-title{fill:#0f172a;font-size:13px;font-weight:700}"
                            ".chart-startup{fill:#dff3f5;opacity:.78}"
                            ".chart-stable-marker{stroke:#0f7a86;stroke-width:2.2;stroke-dasharray:4 3}"
                            ".chart-line{stroke-width:2.6;stroke-linecap:round;stroke-linejoin:round}"
                            ".chart-line.cumulative{stroke:#0f7a86}"
                            ".chart-line.window{stroke:#2563ad}"
                            ".calibration-detail-note{color:var(--eb-muted);margin:8px 0}"
                            "@media(max-width:720px){.calibration-chart-head{display:block}.calibration-chart svg{max-height:none}}"
                            "</style>");
    Esp32BaseWeb::beginPanel("样本概览");
    Esp32BaseWeb::sendChunk("<div class='calibration-detail-grid'>");
    char text[40];
    snprintf(text, sizeof(text), "%u", static_cast<unsigned>(displayIndex));
    sendMetricCard("样本", text, "当前 RAM 样本");
    snprintf(text, sizeof(text), "%u", static_cast<unsigned>(sample.zoneId));
    sendMetricCard("水路", text, sample.valid ? "有效样本" : sample.invalidReason);
    snprintf(text, sizeof(text), "%lu ml", static_cast<unsigned long>(sample.actualMl));
    sendMetricCard("实际水量", text, "量杯实测输入");
    snprintf(text, sizeof(text), "%lu", static_cast<unsigned long>(sample.totalPulses));
    sendMetricCard("总脉冲", text, "完整采集总量");
    snprintf(text, sizeof(text), "%u", static_cast<unsigned>(sample.detailCapturedPulses));
    sendMetricCard("明细脉冲", text, sample.detailCaptureEndedReason);
    snprintf(text, sizeof(text), "%u", static_cast<unsigned>(sample.windowPulseCount));
    sendMetricCard("窗口点数", text, "200 ms 一点");
    Esp32BaseWeb::sendChunk("</div><div class='tablewrap'><table class='part'><tbody><tr><th>采集时长</th><td>");
    writeDurationMsHumanCompact(sample.durationMs);
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>稳定开始</th><td>");
    writeDurationMsHumanCompact(sample.stableStartMs);
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>启动脉冲</th><td>");
    writeUInt(sample.startupPulseInSample);
    Esp32BaseWeb::sendChunk("</td></tr><tr><th>稳定流速</th><td>");
    writeUInt(sample.stableRatePerMinuteX1000 / 1000UL);
    Esp32BaseWeb::sendChunk(" 脉冲/分钟</td></tr><tr><th>波动</th><td>");
    writeUInt(sample.rateVariationPermille);
    Esp32BaseWeb::sendChunk("‰</td></tr></tbody></table></div><div class='calibration-detail-summary'><span><b>横坐标</b>时间，按采集时长分成 6 段显示。</span><span><b>纵坐标</b>当前图表对应的脉冲数量，按 5 段显示。</span><span><b>稳定标记</b>浅色为启动阶段，虚线为稳定开始。</span></div><div class='actions'><a class='btnlink secondary' href='/irrigation/calibration'>返回流量校准</a></div>");
    Esp32BaseWeb::endPanel();

    Esp32BaseWeb::beginPanel("图表");
    if (sample.detailCapturedPulses == 0 && sample.windowPulseCount == 0) {
        Esp32BaseWeb::sendChunk("<p class='calibration-detail-note'>该样本没有可展示的图表明细。</p>");
    } else {
        Esp32BaseWeb::sendChunk("<p class='calibration-detail-note'>浅色区域表示稳定起点之前的启动阶段，竖线为识别出的稳定开始时间。</p>");
        if (sample.detailCapturedPulses > 0) {
            writeCumulativePulseChart(sampleIndex, sample);
        }
        if (sample.windowPulseCount > 0) {
            writeWindowPulseChart(sampleIndex, sample);
        }
    }
    Esp32BaseWeb::endPanel();
    pageFooter();
}

struct RecordJsonContext {
    bool first;
};

void writeRecordJson(const RecordStore::WateringRecord& record, void* user) {
    RecordJsonContext* ctx = static_cast<RecordJsonContext*>(user);
    if (!ctx->first) Esp32BaseWeb::sendChunk(",");
    ctx->first = false;
    Esp32BaseWeb::sendChunk("{\"recordId\":");
    writeUInt(record.recordId);
    Esp32BaseWeb::sendChunk(",\"zoneId\":");
    writeUInt(record.zoneId);
    Esp32BaseWeb::sendChunk(",\"taskType\":\"");
    Esp32BaseWeb::writeJsonEscaped(Irrigation::taskTypeName(static_cast<Irrigation::TaskType>(record.taskType)));
    Esp32BaseWeb::sendChunk("\",\"result\":\"");
    Esp32BaseWeb::writeJsonEscaped(Irrigation::taskResultName(static_cast<Irrigation::TaskResult>(record.result)));
    Esp32BaseWeb::sendChunk("\",\"planId\":");
    writeUInt(record.planId);
    Esp32BaseWeb::sendChunk(",\"planName\":\"");
    Esp32BaseWeb::writeJsonEscaped(record.planNameSnapshot);
    Esp32BaseWeb::sendChunk("\",\"targetSec\":");
    writeUInt(record.targetSec);
    Esp32BaseWeb::sendChunk(",\"startedEpoch\":");
    writeUInt(record.startedEpoch);
    Esp32BaseWeb::sendChunk(",\"endedEpoch\":");
    writeUInt(record.endedEpoch);
    Esp32BaseWeb::sendChunk(",\"estimatedMl\":");
    writeUInt(record.estimatedMilliliters);
    Esp32BaseWeb::sendChunk(",\"averageFlowMlPerMin\":");
    writeUInt(averageFlowMlPerMin(record));
    Esp32BaseWeb::sendChunk(",\"flowStatsValid\":");
    writeBool(record.flowStatsValid);
    Esp32BaseWeb::sendChunk(",\"flowRateWindowSec\":");
    writeUInt(record.flowRateWindowSec);
    Esp32BaseWeb::sendChunk(",\"maxFlowMlPerMin\":");
    writeUInt(record.maxFlowMlPerMin);
    Esp32BaseWeb::sendChunk(",\"maxFlowFirstAtSec\":");
    writeUInt(record.maxFlowFirstAtSec);
    Esp32BaseWeb::sendChunk(",\"minFlowMlPerMin\":");
    writeUInt(record.minFlowMlPerMin);
    Esp32BaseWeb::sendChunk(",\"minFlowFirstAtSec\":");
    writeUInt(record.minFlowFirstAtSec);
    Esp32BaseWeb::sendChunk("}");
}

struct EventJsonContext {
    bool first;
};

void writeEventJson(const Esp32BaseAppEventRecord& event, void* user) {
    EventJsonContext* ctx = static_cast<EventJsonContext*>(user);
    if (!ctx->first) Esp32BaseWeb::sendChunk(",");
    ctx->first = false;
    Esp32BaseWeb::sendChunk("{\"id\":");
    writeUInt(event.id);
    Esp32BaseWeb::sendChunk(",\"uptimeSec\":");
    writeUInt(event.uptimeSec);
    Esp32BaseWeb::sendChunk(",\"epochSec\":");
    writeUInt(event.epochSec);
    Esp32BaseWeb::sendChunk(",\"level\":\"");
    Esp32BaseWeb::writeJsonEscaped(Esp32BaseAppEventLog::levelName(static_cast<Esp32BaseAppEventLog::Level>(event.level)));
    Esp32BaseWeb::sendChunk("\",\"source\":\"");
    Esp32BaseWeb::writeJsonEscaped(event.source);
    Esp32BaseWeb::sendChunk("\",\"type\":\"");
    Esp32BaseWeb::writeJsonEscaped(event.type);
    Esp32BaseWeb::sendChunk("\",\"reason\":\"");
    Esp32BaseWeb::writeJsonEscaped(event.reason);
    Esp32BaseWeb::sendChunk("\",\"object\":\"");
    Esp32BaseWeb::writeJsonEscaped(event.object);
    Esp32BaseWeb::sendChunk("\",\"code\":");
    writeUInt(event.code);
    Esp32BaseWeb::sendChunk(",\"value1\":");
    writeInt(event.value1);
    Esp32BaseWeb::sendChunk(",\"value2\":");
    writeInt(event.value2);
    Esp32BaseWeb::sendChunk(",\"value3\":");
    writeInt(event.value3);
    Esp32BaseWeb::sendChunk(",\"valueMask\":");
    writeUInt(event.valueMask);
    Esp32BaseWeb::sendChunk(",\"text\":\"");
    Esp32BaseWeb::writeJsonEscaped(event.text);
    Esp32BaseWeb::sendChunk("\"}");
}

struct RecordTableContext {
    bool wrote;
};

