tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
void writeRecordRow(const RecordStore::WateringRecord& record, void* user) {
    RecordTableContext* ctx = static_cast<RecordTableContext*>(user);
    ctx->wrote = true;
    Esp32BaseWeb::sendChunk("<tr><td>");
    writeUInt(record.recordId);
    Esp32BaseWeb::sendChunk("</td><td>");
    if (Irrigation::validZoneId(record.zoneId)) {
        Esp32BaseWeb::writeHtmlEscaped(ZoneManager::config(record.zoneId).name);
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(taskTypeLabel(static_cast<Irrigation::TaskType>(record.taskType)));
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(taskResultLabel(static_cast<Irrigation::TaskResult>(record.result)));
    Esp32BaseWeb::sendChunk("</td><td>");
    if (record.planId == Irrigation::NoPlanId) {
        Esp32BaseWeb::sendChunk("-");
    } else {
        writeUInt(record.planId);
        Esp32BaseWeb::sendChunk(" ");
        Esp32BaseWeb::writeHtmlEscaped(record.planNameSnapshot);
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    writeDurationHuman(record.targetSec);
    Esp32BaseWeb::sendChunk("</td><td>");
    writeShortDateTimeHuman(record.startedEpoch);
    Esp32BaseWeb::sendChunk("</td><td>");
    if (record.endedUptimeMs >= record.startedUptimeMs) {
        writeDurationMsHumanCompact(record.endedUptimeMs - record.startedUptimeMs);
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    Esp32BaseWeb::sendChunk("</td><td>");
    writeLitersFromMilliliters(record.estimatedMilliliters);
    Esp32BaseWeb::sendChunk("</td><td>");
    writeAverageFlowRate(record);
    Esp32BaseWeb::sendChunk("</td><td>");
    writeRecordPeakFlow(record.maxFlowMlPerMin, record.maxFlowFirstAtSec, record.flowStatsValid);
    Esp32BaseWeb::sendChunk("</td><td>");
    writeRecordPeakFlow(record.minFlowMlPerMin, record.minFlowFirstAtSec, record.flowStatsValid);
    Esp32BaseWeb::sendChunk("</td></tr>");
}

struct EventTableContext {
    bool wrote;
};

struct EventFindContext {
    uint32_t id;
    bool found;
    Esp32BaseAppEventRecord event;
};

void findEventById(const Esp32BaseAppEventRecord& event, void* user) {
    EventFindContext* ctx = static_cast<EventFindContext*>(user);
    if (!ctx || ctx->found || event.id != ctx->id) {
        return;
    }
    ctx->event = event;
    ctx->found = true;
}

void writeEventRow(const Esp32BaseAppEventRecord& event, void* user) {
    EventTableContext* ctx = static_cast<EventTableContext*>(user);
    ctx->wrote = true;
    Esp32BaseWeb::sendChunk("<tr><td><a href='/irrigation/events/detail?id=");
    writeUInt(event.id);
    Esp32BaseWeb::sendChunk("'>");
    writeUInt(event.id);
    Esp32BaseWeb::sendChunk("</a></td><td>");
    Esp32BaseWeb::writeHtmlEscaped(appEventLevelLabel(event.level));
    Esp32BaseWeb::sendChunk("</td><td>");
    writeEventTimeHuman(event);
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(appEventTypeLabel(event.type));
    Esp32BaseWeb::sendChunk("</td><td>");
    Esp32BaseWeb::writeHtmlEscaped(appEventSourceLabel(event.source));
    Esp32BaseWeb::sendChunk("</td><td>");
    writeEventZoneName(eventZoneId(event));
    Esp32BaseWeb::sendChunk("</td><td>");
    writeEventDetail(event);
    Esp32BaseWeb::sendChunk("</td><td><a class='btnlink compact' href='/irrigation/events/detail?id=");
    writeUInt(event.id);
    Esp32BaseWeb::sendChunk("'>详情</a>");
    Esp32BaseWeb::sendChunk("</td></tr>");
}

void writeEventKvStart(const char* label) {
    Esp32BaseWeb::sendChunk("<tr><th>");
    Esp32BaseWeb::writeHtmlEscaped(label);
    Esp32BaseWeb::sendChunk("</th><td>");
}

void writeEventKvEnd() {
    Esp32BaseWeb::sendChunk("</td></tr>");
}

void writeEventKvText(const char* label, const char* value) {
    writeEventKvStart(label);
    Esp32BaseWeb::writeHtmlEscaped(value ? value : "");
    writeEventKvEnd();
}

void writeEventDetailPanel(const Esp32BaseAppEventRecord& event) {
    Esp32BaseWeb::beginPanel("事件详情");
    Esp32BaseWeb::sendChunk("<table class='kv'><tbody>");
    writeEventKvStart("ID");
    writeUInt(event.id);
    writeEventKvEnd();
    writeEventKvText("等级", appEventLevelLabel(event.level));
    writeEventKvStart("发生时间");
    writeEventTimeHuman(event);
    writeEventKvEnd();
    writeEventKvText("类型", appEventTypeLabel(event.type));
    writeEventKvText("来源", appEventSourceLabel(event.source));
    writeEventKvStart("水路");
    writeEventZoneName(eventZoneId(event));
    writeEventKvEnd();
    writeEventKvStart("事件说明");
    writeEventDetail(event);
    writeEventKvEnd();
    writeEventKvText("这是什么意思", appEventUserExplanation(event));
    writeEventKvText("建议处理", appEventUserAdvice(event));
    Esp32BaseWeb::sendChunk("</tbody></table><div class='actions'><a class='btnlink secondary' href='/irrigation/events'>返回事件记录</a></div>");
    Esp32BaseWeb::endPanel();
}

void handleRecordsPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint32_t page = 1;
    uint32_t perPage = 20;
    uint16_t offset = 0;
    readPaging(RecordStore::count(), 20, &page, &perPage, &offset);
    pageHeader("浇水记录");
    Esp32BaseWeb::sendPageTitle("浇水记录", "按时间倒序展示浇水执行记录。");
    Esp32BaseWeb::beginPanel("列表");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>ID</th><th>水路</th><th>类型</th><th>结果</th><th>计划</th><th>目标时长</th><th>开始时间</th><th>运行时间</th><th>估算水量</th><th>平均流速</th><th>最大流速</th><th>最小流速</th></tr></thead><tbody>");
    RecordTableContext ctx = {false};
    (void)RecordStore::readLatest(offset, static_cast<uint16_t>(perPage), writeRecordRow, &ctx);
    if (!ctx.wrote) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='12'>暂无记录</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    Esp32BaseWeb::sendPagination({"/irrigation/records", nullptr, page, perPage, RecordStore::count()});
    Esp32BaseWeb::endPanel();
    pageFooter();
}

void handleEventsPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint32_t page = 1;
    uint32_t perPage = 20;
    uint16_t offset = 0;
    readPaging(Esp32BaseAppEventLog::count(), 20, &page, &perPage, &offset);
    pageHeader("事件记录");
    Esp32BaseWeb::sendPageTitle("事件记录", "按时间倒序展示灌溉业务重要事件；设备系统日志请到 Esp32Base 查看。");
    if (Esp32BaseAppEventLog::faulted()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "事件日志存储故障", Esp32BaseAppEventLog::lastError());
    } else if (!Esp32BaseAppEventLog::isReady()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "事件日志未就绪", Esp32BaseAppEventLog::lastError());
    }
    Esp32BaseWeb::beginPanel("列表");
    Esp32BaseWeb::sendChunk("<div class='tablewrap'><table class='part'><thead><tr><th>ID</th><th>等级</th><th>时间</th><th>类型</th><th>来源</th><th>水路</th><th>说明</th><th>操作</th></tr></thead><tbody>");
    EventTableContext ctx = {false};
    (void)Esp32BaseAppEventLog::readLatest(offset, static_cast<uint16_t>(perPage), writeEventRow, &ctx);
    if (!ctx.wrote) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='8'>暂无事件</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</tbody></table></div>");
    Esp32BaseWeb::sendPagination({"/irrigation/events", nullptr, page, perPage, Esp32BaseAppEventLog::count()});
    Esp32BaseWeb::endPanel();
    pageFooter();
}

void handleEventDetailPage() {
    if (!Esp32BaseWeb::checkAuth()) return;
    uint32_t id = 0;
    pageHeader("事件详情");
    Esp32BaseWeb::sendPageTitle("事件详情", "用用户能理解的语言说明这条灌溉业务事件。");
    if (!readU32("id", &id)) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "事件 ID 无效", "请从事件记录列表重新进入详情。");
        Esp32BaseWeb::beginPanel();
        Esp32BaseWeb::sendChunk("<div class='actions'><a class='btnlink secondary' href='/irrigation/events'>返回事件记录</a></div>");
        Esp32BaseWeb::endPanel();
        pageFooter();
        return;
    }
    EventFindContext ctx = {id, false, {}};
    const bool readOk = Esp32BaseAppEventLog::readLatest(0, Esp32BaseAppEventLog::count(), findEventById, &ctx);
    if (!readOk) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "事件读取失败", Esp32BaseAppEventLog::lastError());
    } else if (!ctx.found) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "事件不存在", "该事件可能已被新的记录覆盖。");
    } else {
        writeEventDetailPanel(ctx.event);
    }
    if (!ctx.found) {
        Esp32BaseWeb::beginPanel();
        Esp32BaseWeb::sendChunk("<div class='actions'><a class='btnlink secondary' href='/irrigation/events'>返回事件记录</a></div>");
        Esp32BaseWeb::endPanel();
    }
    pageFooter();
}

void handleStatusApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    beginJson(200);
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"timeSynced\":");
#if ESP32BASE_ENABLE_NTP
    writeBool(Esp32BaseNtp::isTimeSynced());
#else
    writeBool(false);
#endif
    Esp32BaseWeb::sendChunk(",\"leakAlertActive\":");
    writeBool(ZoneManager::leakAlertActive());
    Esp32BaseWeb::sendChunk(",\"zones\":[");
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        if (zoneId > 1) Esp32BaseWeb::sendChunk(",");
        writeStatusJson(ZoneManager::status(zoneId));
    }
    Esp32BaseWeb::sendChunk("]}");
    endJson();
}

void handleFlowHistoryApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    uint8_t zoneId = 0;
    if (!readZoneId(&zoneId)) {
        sendError(400, "invalid_zone");
        return;
    }
    uint16_t points[FlowMeter::MaxFlowHistoryPoints] = {};
    const uint16_t count = FlowMeter::readFlowHistory(zoneId, points, FlowMeter::MaxFlowHistoryPoints);
    beginJson(200);
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"zoneId\":");
    writeUInt(zoneId);
    Esp32BaseWeb::sendChunk(",\"intervalSec\":");
    writeUInt(FlowMeter::flowChartIntervalSec());
    Esp32BaseWeb::sendChunk(",\"historyMin\":");
    writeUInt(FlowMeter::flowChartHistoryMin());
    Esp32BaseWeb::sendChunk(",\"flowHistory\":[");
    for (uint16_t i = 0; i < count; ++i) {
        if (i) Esp32BaseWeb::sendChunk(",");
        writeUInt(points[i]);
    }
    Esp32BaseWeb::sendChunk("]}");
    endJson();
}

void handleCalibrationStatusApi() {
    if (!Esp32BaseWeb::checkAuth()) return;
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_GET)) {
        sendMethodNotAllowed("GET");
        return;
    }
    FlowCalibration::StatusSnapshot snapshot = {};
    FlowCalibration::status(&snapshot);
    const Irrigation::SystemConfig& system = SystemConfigStore::current();
    uint8_t selectedZoneId = 1;
    (void)readOptionalZoneId(&selectedZoneId);
    const uint8_t zoneId = Irrigation::validZoneId(snapshot.activeZoneId) ? snapshot.activeZoneId : selectedZoneId;
    const uint32_t elapsedSec = (snapshot.elapsedMs + 999UL) / 1000UL;
    const uint32_t remainingSec = (snapshot.remainingMs + 999UL) / 1000UL;
    const uint8_t sampleCapacity = snapshot.state == FlowCalibration::State::IDLE ? system.calibrationSampleTarget : snapshot.sampleCapacity;
    uint32_t estimatedMl = 0;
    uint32_t flowMlPerMin = 0;
    bool flowRateReady = false;
    if (zoneId != 0) {
        const Irrigation::ZoneConfig& zone = ZoneManager::config(zoneId);
        estimatedMl = estimateMlFromFlowPulses(snapshot.currentPulses, zone.flow);
        flowMlPerMin = FlowMeter::flowMillilitersPerMinute(zoneId);
        flowRateReady = FlowMeter::flowRateReady(zoneId);
    }
    beginJson(200);
    Esp32BaseWeb::sendChunk("{\"ok\":true,\"state\":\"");
    Esp32BaseWeb::writeJsonEscaped(calibrationStateName(snapshot.state));
    Esp32BaseWeb::sendChunk("\",\"stateLabel\":\"");
    Esp32BaseWeb::writeJsonEscaped(calibrationStateLabel(snapshot.state));
    Esp32BaseWeb::sendChunk("\",\"zoneId\":");
    writeUInt(zoneId);
    Esp32BaseWeb::sendChunk(",\"zoneName\":\"");
    if (zoneId != 0) {
        Esp32BaseWeb::writeJsonEscaped(ZoneManager::config(zoneId).name);
    }
    Esp32BaseWeb::sendChunk("\",\"sampleCount\":");
    writeUInt(FlowCalibration::sampleCount());
    Esp32BaseWeb::sendChunk(",\"validSampleCount\":");
    writeUInt(FlowCalibration::validSampleCount());
    Esp32BaseWeb::sendChunk(",\"sampleCapacity\":");
    writeUInt(sampleCapacity == 0 ? system.calibrationSampleTarget : sampleCapacity);
    Esp32BaseWeb::sendChunk(",\"elapsedSec\":");
    writeUInt(elapsedSec);
    Esp32BaseWeb::sendChunk(",\"remainingSec\":");
    writeUInt(remainingSec);
    Esp32BaseWeb::sendChunk(",\"currentPulses\":");
    writeUInt(snapshot.currentPulses);
    Esp32BaseWeb::sendChunk(",\"estimatedMl\":");
    writeUInt(estimatedMl);
    Esp32BaseWeb::sendChunk(",\"flowMlPerMin\":");
    writeUInt(flowMlPerMin);
    Esp32BaseWeb::sendChunk(",\"flowRateReady\":");
    writeBool(flowRateReady);
    Esp32BaseWeb::sendChunk(",\"currentFlow\":");
    writeFlowParametersJson(ZoneManager::config(zoneId).flow);
    Esp32BaseWeb::sendChunk(",\"candidateFlow\":{\"exists\":");
    writeBool(ZoneManager::config(zoneId).candidateFlow.exists);
    Esp32BaseWeb::sendChunk(",\"matchesCurrent\":");
    writeBool(ZoneManager::config(zoneId).candidateFlow.exists &&
              ZoneConfigStore::flowParametersEqual(ZoneManager::config(zoneId).flow, ZoneManager::config(zoneId).candidateFlow.params));
    Esp32BaseWeb::sendChunk(",\"params\":");
    writeFlowParametersJson(ZoneManager::config(zoneId).candidateFlow.exists
                                ? ZoneManager::config(zoneId).candidateFlow.params
                                : ZoneManager::config(zoneId).flow);
    Esp32BaseWeb::sendChunk("}");
    Esp32BaseWeb::sendChunk(",\"pendingExists\":");
    writeBool(snapshot.pendingExists);
    Esp32BaseWeb::sendChunk(",\"pendingDurationSec\":");
    writeUInt((snapshot.pendingDurationMs + 999UL) / 1000UL);
    Esp32BaseWeb::sendChunk(",\"pendingTotalPulses\":");
    writeUInt(snapshot.pendingTotalPulses);
    Esp32BaseWeb::sendChunk(",\"pendingDetailCapturedPulses\":");
    writeUInt(snapshot.pendingDetailCapturedPulses);
    Esp32BaseWeb::sendChunk(",\"lastError\":\"");
    Esp32BaseWeb::writeJsonEscaped(FlowCalibration::lastError());
    Esp32BaseWeb::sendChunk("\"}");
    endJson();
}

